"------------------------------------------------------------------------------
" Плагин отображения имен файлов открытых буферов в зоне tabline
"------------------------------------------------------------------------------
packadd vim-xtabline
let g:xtabline_settings.tab_number_in_left_corner = 1
:silent! XTabMode buffers

" -----------------------------------------------------------------------------
"  Дополнения для подсветки синтаксиса C/C++ исходных файлов
" -----------------------------------------------------------------------------
packadd vim-cpp-modern

" -----------------------------------------------------------------------------
" Интерактивное изменение цветов подсветки синтаксиса
" Вызов поизводится сочтанием |yc|
" переключение Fg/Bg - клавиша B
" Выход q
" После выхода можно записать строку в открытый файл командой :MacawWrite
" -----------------------------------------------------------------------------
"packadd vim-macaw

